
import sys
from math import sqrt
from random import randint
import pygame
from pygame.locals import QUIT, KEYDOWN, K_LEFT, K_RIGHT, K_DOWN, K_SPACE, K_UP

BLOCK_DATA = (
    ( # L        
        (0, 1, 0, \
         0, 1, 0, \
         0, 1, 1),
        (0, 0, 0, \
         1, 1, 1, \
         1, 0, 0),
        (1, 1, 0, \
         0, 1, 0, \
         0, 1, 0),
        (0, 0, 1, \
         1, 1, 1, \
         0, 0, 0)
    ),
    ( # J (Reverse L) 
        (0, 2, 0, \
         0, 2, 0, \
         2, 2, 0),
        (2, 0, 0, \
         2, 2, 2, \
         0, 0, 0),
        (0, 2, 2, \
         0, 2, 0, \
         0, 2, 0),
        (0, 0, 0, \
         2, 2, 2, \
         0, 0, 2)        
    ),
    ( # T
        (0, 3, 0, \
         3, 3, 3, \
         0, 0, 0),
        (0, 3, 0, \
         0, 3, 3, \
         0, 3, 0)
        (0, 0, 0, \
         3, 3, 3, \
         0, 3, 0)
        (0, 3, 0, \
         3, 3, 0, \
         0, 3, 0)        
    ),
    ( # Z
        (4, 4, 0, \
         0, 4, 4, \
         0, 0, 0),
        (0, 0, 4, \
         0, 4, 4, \
         0, 4, 0),
        (0, 0, 0, \
         4, 4, 0, \
         0, 4, 4),
        (0, 4, 0, \
         4, 4, 0, \
         4, 0, 0)        
    ),
    ( # S Reverse Z
        (0, 5, 5, \
         5, 5, 0, \
         0, 0, 0),
        (0, 5, 0, \
         0, 5, 5, \
         0, 0, 5),
        (0, 0, 0, \
         0, 5, 5, \
         5, 5, 0),
        (5, 0, 0, \
         5, 5, 0, \
         0, 5, 0)   
    ),   
    ( # O
        (6, 6, 6, 6), 
        (6, 6, 6, 6), 
        (6, 6, 6, 6), 
        (6, 6, 6, 6)
    ),
    ( # I
        (0, 7, 0, 0, \
         0, 7, 0, 0, \
         0, 7, 0, 0, \
         0, 7, 0, 0)
    )         
)


turn = randint(0, 3)
type = BLOCK_DATA[randint(0, 6)]
data = type[turn]              # 랜덤으로 나온 테트미노 블록을 회전
size = int(sqrt(len(data)))

print(type)
print(data)
print(size)
